"""
1. Реализовать функцию, принимающую два числа (позиционные аргументы) и
выполняющую их деление. Числа запрашивать у пользователя, предусмотреть
обработку ситуации деления на ноль.
"""
num_1 = int(input("Введите первое число: "))
num_2 = int(input("Введите второе число: "))

def split_(a, b):
    c = a / b if b != 0 else "На ноль делить нельзя!"
    print(c)
split_(num_1, num_2)

"""
2. Реализовать функцию, принимающую несколько параметров, описывающих данные
пользователя: имя, фамилия, год рождения, город проживания, email, телефон. 
Функция должна принимать параметры как именованные аргументы. Реализовать 
вывод данных о пользователе одной строкой.
"""
def data(name_, surname_, year_, city_, email_, phon_number):
    return print(f'Данные о пользователе : имя:{name_}, фамилия:{surname_},'
                 f' год рождения:{year_}, город проживания:{city_},'
                 f' email:{email_}, телефон:{phon_number} ')

data(email_ = input("Email:"),
     city_ = input("Город проживания:"),
     name_ = input("Имя:"),
     surname_ = input("Фамилия:"),
     year_ = input("Год рождения:"),
     phon_number = input("телефон:"))
"""
3. Реализовать функцию my_func(), которая принимает три позиционных аргумента, 
и возвращает сумму наибольших двух аргументов.
"""

num_1 = int(input("Введите первое число: "))
num_2 = int(input("Введите второе число: "))
num_3 = int(input("Введите второе число: "))

def my_func(a, b, c):
    list_ = [a, b, c]
    list_.sort()
    sum_ = list_[-1] + list_[1]
    return sum_
print(my_func(num_1, num_2, num_3))

"""
4. Программа принимает действительное положительное число x и целое 
отрицательное число y. Необходимо выполнить возведение числа x в степень y. 
Задание необходимо реализовать в виде функции my_func(x, y). При решении 
задания необходимо обойтись без встроенной функции возведения числа в степень.
"""

"""
Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в 
степень с помощью оператора *. Второй — более сложная реализация без оператора
*, предусматривающая использование цикла.
"""
"""
1. Программа запрашивает у пользователя строку чисел, разделенных пробелом. 
При нажатии Enter должна выводиться сумма чисел. Пользователь может продолжить
ввод чисел, разделенных пробелом и снова нажать Enter. Сумма вновь введенных 
чисел будет добавляться к уже подсчитанной сумме. Но если вместо числа вводится
специальный символ, выполнение программы завершается. Если специальный символ 
введен после нескольких чисел, то вначале нужно добавить сумму этих чисел к 
полученной ранее сумме и после этого завершить программу.
2. Реализовать функцию int_func(), принимающую слово из маленьких латинских букв
и возвращающую его же, но с прописной первой буквой. Например, 
print(int_func(‘text’)) -> Text.

Продолжить работу над заданием. В программу должна попадать строка из слов, 
разделенных пробелом. Каждое слово состоит из латинских букв в нижнем регистре.
Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной 
буквы. Необходимо использовать написанную ранее функцию int_func().
"""