"""
1. Реализовать функцию, принимающую два числа (позиционные аргументы) и
выполняющую их деление. Числа запрашивать у пользователя, предусмотреть
обработку ситуации деления на ноль.
"""
num_1 = int(input("Введите первое число: "))
num_2 = int(input("Введите второе число: "))


def split_(x, y):
    c = x / y if y != 0 else "На ноль делить нельзя!"
    print(c)


split_(num_1, num_2)

"""
2. Реализовать функцию, принимающую несколько параметров, описывающих данные
пользователя: имя, фамилия, год рождения, город проживания, email, телефон. 
Функция должна принимать параметры как именованные аргументы. Реализовать 
вывод данных о пользователе одной строкой.
"""


def data(name_, surname_, year_, city_, email_, phon_number):
    return print(f'Данные о пользователе : имя:{name_}, фамилия:{surname_},'
                 f' год рождения:{year_}, город проживания:{city_},'
                 f' email:{email_}, телефон:{phon_number} ')


data(email_=input("Email:"),
     city_=input("Город проживания:"),
     name_=input("Имя:"),
     surname_=input("Фамилия:"),
     year_=input("Год рождения:"),
     phon_number=input("телефон:"))

"""
3. Реализовать функцию my_func(), которая принимает три позиционных аргумента, 
и возвращает сумму наибольших двух аргументов.
"""

num_1 = int(input("Введите первое число: "))
num_2 = int(input("Введите второе число: "))
num_3 = int(input("Введите второе число: "))


def my_func(x, y, z):
    list_ = [x, y, z]
    list_.sort()
    sum_ = list_[-1] + list_[1]
    return sum_


print(f'Сумма наибольших двух аргументов: {my_func(num_1, num_2, num_3)}')

"""
4. Программа принимает действительное положительное число x и целое 
отрицательное число y. Необходимо выполнить возведение числа x в степень y. 
Задание необходимо реализовать в виде функции my_func(x, y). При решении 
задания необходимо обойтись без встроенной функции возведения числа в степень.
"""
print("Возведение числа x в степень y")
a = abs(round(float(input("Введите действительное положительное число x: "))))
b = round(float(input("Введите целое отрицательное число y: ")))


def my_func(x, y):
    if b < 0:
        c = 1
        y = abs(y)
        for i in range(1, (y + 1)):
            c = c * x
            # print(c)
            return print(1 / c)
    else:
        return print("Вы ввели некорректное второе число!")


my_func(a, b)
"""
Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в 
степень с помощью оператора *. Второй — более сложная реализация без оператора
*, предусматривающая использование цикла.
"""
"""
1. Программа запрашивает у пользователя строку чисел, разделенных пробелом. 
При нажатии Enter должна выводиться сумма чисел. Пользователь может продолжить
ввод чисел, разделенных пробелом и снова нажать Enter. Сумма вновь введенных 
чисел будет добавляться к уже подсчитанной сумме. Но если вместо числа вводится
специальный символ, выполнение программы завершается. Если специальный символ 
введен после нескольких чисел, то вначале нужно добавить сумму этих чисел к 
полученной ранее сумме и после этого завершить программу.
"""


def str_to_list_nums(line):
    """функция конвертирует строку в число"""
    line = line.strip()
    # если в строке только цифры
    if line.isdigit():
        return list(line)


def sum_nums(list_, c=0):
    length_nums = len(list_)
    # print(length_nums)
    # print(c)
    for i in range(length_nums):
        c = c + int(list_[i])
    # print(f'сумма: {c}\n')
    return c


sums_ = 0

while True:
    inpt = input("Ожидается ввод числа или Enter:")
    n = str_to_list_nums(inpt)
    if inpt == '':
        continue
    elif inpt == '@':
        print('Finish!')
        break
    elif sums_ != 0:
        print(f'сумма: {sum_nums(n, c=sums_)}')
        sums_ += sums_
        continue
    sums_ = sum_nums(n)
    # print(type(n))
    print(f'сумма: {sum_nums(n)}')

"""
2. Реализовать функцию int_func(), принимающую слово из маленьких латинских
букв и возвращающую его же, но с прописной первой буквой. Например, 
print(int_func(‘text’)) -> Text.

Продолжить работу над заданием. В программу должна попадать строка из слов, 
разделенных пробелом. Каждое слово состоит из латинских букв в нижнем регистре.
Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной 
буквы. Необходимо использовать написанную ранее функцию int_func().
"""