"""
1.Поработайте с переменными, создайте несколько, выведите на экран,
запросите у пользователя несколько чисел и строк и сохраните в переменные,
выведите на экран.
"""
print("Задача №1")
eggs = int(10)
spam = 'text'
print(eggs, spam)
var_1 = input("введите  чисел : ")
var_2 = input("введите  слово : ")
print(var_1, var_2)

"""
2.Пользователь вводит время в секундах. Переведите время в часы, минуты
и секунды и выведите в формате чч:мм:сс. Используйте форматирование строк.
"""
print("\nЗадача №2")
seconds = int(input("Введите время в секундах :"))
hh = seconds // 3600
mm = int(seconds / 60) % 24
ss = seconds % 3600 % 60
print(f"Ответ: {hh:02}:{mm:02}:{ss:02}")

"""
3.Узнайте у пользователя число n. Найдите сумму чисел n + nn + nnn.
Например, пользователь ввёл число 3. Считаем 3 + 33 + 333 = 369.
"""
print("\nЗадача №3")
n = input("Введите число : ")
print("Ответ : ", int(n) + int(n * 2) + int(n * 3))

"""
4.Пользователь вводит целое положительное число. Найдите самую большую цифру
в числе. Для решения используйте цикл while и арифметические
операции.
"""

print("\nЗадача №4")
num = abs(int(input("Введите число : ")))  # abs - получение модуля числа
last_digit = num % 10  # определяем последнюю цифру в числе
# print(last_digit)
while num > last_digit:
    num = num // 10
    # print(num)
    if num % 10 > last_digit:
        last_digit = num % 10
print("Максимальное цифра в числе ", last_digit)

"""
5.Запросите у пользователя значения выручки и издержек фирмы. Определите,
с каким финансовым результатом работает фирма (прибыль — выручка больше
издержек, или убыток — издержки больше выручки). Выведите соответствующее
сообщение. 
Если фирма отработала с прибылью, вычислите рентабельность выручки 
(соотношение прибыли к выручке). 
Далее запросите численность сотрудников фирмы и определите прибыль 
фирмы в расчете на одного сотрудника.
"""
print("\nЗадача №5")
proceeds = float(input("Введите выручку фирмы : "))
costs = float(input("Введите издержки фирмы : "))
if proceeds > costs:
    print(f"Фирма отработала с прибылью {(proceeds - costs)}")
    workers = int(input("Введите численность сотрудников : "))
    print(f"Прибыль фирмы в расчете на одного сторудника : "
          f" {(proceeds - costs) / workers:.2f}")
elif proceeds == costs:
    print("Выручка фирмы равно издержкам")
else:
    print("Фирма работает в убыток")

"""
6.Спортсмен занимается ежедневными пробежками. В первый день его результат
составил a километров. Каждый день спортсмен увеличивал результат на 10 %
относительно предыдущего. Требуется определить номер дня,
на который общий результат спортсмена составить не менее b километров. 
Программа должна принимать значения параметров a и b и выводить одно
 натуральное число — номер дня.
"""

print("\nЗадача №6")
a = int(input("Введите результат в первый день, км : "))
b = int(input("Введите ожидаемый результат, км : "))
i = 1
while a <= b:
    i += 1
    a = a * 1.1
# print("Ответ : " +  str("%.2f" % a) + " км. за " + str(i) + " дня(дней)")
print(f"Ответ: {a:.2f} км. за {i} дня(дней)")
